<?php 
  header( "Content-Type: text/html;charset=utf-8"); 
  // Создание парсера 
  // Функция обработчик начальных тегов 
  // Функция обработчик закрывающих тегов 
  // Функция обработчик текстового содержимого 
  // Назначение обработчиков начальных и конечных тегов 
  // Назначение обработчика текстового содержимого 
?>
<html>

<head>
  <title>Каталог</title>
</head>

<body>
  <h1>Каталог книг</h1>
  <table border="1" width="100%">
    <tr>
      <th>Автор</th>
      <th>Название</th>
      <th>Год издания</th>
      <th>Цена, руб</th>
    </tr>
    <?php
      //Парсинг 
    ?>
  </table>
</body>

</html>